app/views/users/show.html.erb


  <% @user.words.each do |w| %>
---
SELECT "words".* FROM "words" WHERE "words"."user_id" = ?  [["user_id", 4]]