app/views/users/user_with_most_words.html.erb

SELECT  "users".* FROM "users" INNER JOIN "words" ON "words"."user_id" = "users"."id" GROUP BY users.id ORDER BY count(users.id) DESC LIMIT ?  [["LIMIT", 1]]
SELECT "words".* FROM "words" WHERE "words"."user_id" = ?  [["user_id", 6]]
---
<h3>User with most words</h3>
<%=@top_user.username%> (<%=@top_user.words.length%> words)<br>