app/controllers/feelings_controller.rb

  def index
    @feelings = Feeling.all
---
SELECT "feelings".* FROM "feelings"

  def show
    @feeling = Feeling.find(params[:id])
    @words = Word.all
---
SELECT  "feelings".* FROM "feelings" WHERE "feelings"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "words".* FROM "words"