app/controllers/sessions_controller.rb

def create
  if auth
    @user = User.from_omniauth(request.env["omniauth.auth"])
  else
    if (params[:session][:email]=="" ||  params[:session][:password]=="")
      flash[:notice] = "Incorrect username and/or password"
      redirect_to login_path
    else
      @user = User.find_by(email: params[:session][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "user1@gmail.com"], ["LIMIT", 1]]