app/controllers/users_controller.rb

  def create
    if (params[:user][:username]=="" ||  params[:user][:password]=="" || params[:user][:email]=="" || params[:user][:first_name]=="" || params[:user][:last_name]=="")
      flash[:notice] = "Please fill out all fields"
      redirect_to signup_path
    elsif (User.find_by(email: params[:user][:email]).present? || User.find_by(email: params[:user][:username]).present?)
      flash[:notice] = "Email and/or username already taken."
      redirect_to signup_path
    else
      @user = User.create(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "user10@gmail.com"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = ? AND "users"."id" != ? LIMIT ?  [["email", "user10@gmail.com"], ["id", 3], ["LIMIT", 1]]
INSERT INTO "users" ("username", "password_digest", "first_name", "last_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "user1___"], ["password_digest", "$2a$10$x.ymAZmp52D1n64aHO3hmOFnnkkbXQAwKWPv37eJlfBscb0shjKtW"], ["updated_at", "2019-05-06 21:06:50.602653"], ["id", 4]]

  def show
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]