app/controllers/words_controller.rb

SELECT "words".* FROM "words"
---
  def index
    @words_ = Word.all

SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "feelings".* FROM "feelings"
---
  def show
    @word = Word.find_by(id: params[:id])
    @feelings = Feeling.all

SELECT "word_feelings".* FROM "word_feelings"
---
  def new
    @word = Word.new(user_id: current_user.id)##
    @feelings = Feeling.all

INSERT INTO "words" ("entry", "loaded_rating", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["entry", "butter"], ["loaded_rating", 4.0], ["created_at", "2019-05-07 20:26:43.100693"], ["updated_at", "2019-05-07 20:26:43.100693"], ["user_id", 4]]
SELECT "words".* FROM "words"
SELECT "word_feelings".* FROM "word_feelings"
INSERT INTO "word_feelings" ("word_id", "feeling_id", "feeling_rating", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["word_id", 2], ["feeling_id", 9], ["feeling_rating", 5.0], ["created_at", "2019-05-28 19:17:07.626618"], ["updated_at", "2019-05-28 19:17:07.626618"], ["user_id", 6]]
---
  def create
    user = current_user
    @word = Word.create(word_params)

    if !@word.errors.full_messages.empty?
      flash[:notice] = "That word is already in the database"
      redirect_to words_path
    else
      @word.update(word_params)
      @feelings = Feeling.all
      @feelings.each do |feel|
        WordFeeling.create(feeling_id: feel.id, word_id: @word.id, feeling_rating: params[feel.name][:feeling_rating].to_f)